{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Cropping2D", "config": {"input_dtype": "float32", "name": "Crop", "cropping": [[60, 20], [1, 1]], "batch_input_shape": [null, 160, 320, 3], "trainable": true}}, {"class_name": "Lambda", "config": {"output_shape": null, "name": "Resize", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000s\u001f\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000|\u0001\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000d\u0004\u0000\u0083\u0002\u0000S)\u0005N\u00e9\u0000\u0000\u0000\u0000\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000)\u0002r\u0002\u0000\u0000\u0000r\u0003\u0000\u0000\u0000)\u0003\u00da\ntensorflow\u00da\u0005image\u00da\rresize_images)\u0002r\u0005\u0000\u0000\u0000\u00da\u0002tf\u00a9\u0000r\b\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u0006resizes\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\f\u0001", null, null], "output_shape_type": "raw", "arguments": {}, "trainable": true, "function_type": "lambda"}}, {"class_name": "Lambda", "config": {"output_shape": [66, 200, 3], "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>y\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "name": "Normalize", "arguments": {}, "trainable": true, "batch_input_shape": [null, 66, 200, 3], "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "dim_ordering": "tf", "subsample": [2, 2], "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "name": "Conv2D_24", "activation": "elu", "bias": true, "nb_col": 5, "trainable": true, "nb_filter": 24}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "dim_ordering": "tf", "subsample": [2, 2], "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "name": "Conv2D_36", "activation": "elu", "bias": true, "nb_col": 5, "trainable": true, "nb_filter": 36}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "dim_ordering": "tf", "subsample": [2, 2], "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "name": "Conv2D_48", "activation": "elu", "bias": true, "nb_col": 5, "trainable": true, "nb_filter": 48}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "name": "Conv2D_64_1", "activation": "elu", "bias": true, "nb_col": 3, "trainable": true, "nb_filter": 64}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "name": "Conv2D_64_2", "activation": "elu", "bias": true, "nb_col": 3, "trainable": true, "nb_filter": 64}}, {"class_name": "Flatten", "config": {"name": "Flatten", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "input_dim": 1152, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_100", "activation": "elu", "bias": true, "output_dim": 100}}, {"class_name": "Dense", "config": {"b_regularizer": null, "input_dim": 100, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_50", "activation": "elu", "bias": true, "output_dim": 50}}, {"class_name": "Dense", "config": {"b_regularizer": null, "input_dim": 50, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_1", "activation": "elu", "bias": true, "output_dim": 1}}]}